In [1]:
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

In [2]:
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [3]:
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

In [4]:
for type in high_school_types:
    print(type)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [5]:
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [13]:
# Add the Pandas dependency.
import pandas as pd

In [14]:
#create a Pandas series from a list.
school_series = pd.Series(high_schools)
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [15]:
for school in high_schools:
    print(school)

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffin High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rodriguez High School
Johnson High School
Ford High School
Thomas High School

In [16]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [17]:
#convert the array (list of dictionaries) to a DataFrame:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [18]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [19]:
# Initialize a new DataFrame.
schools_df = pd.DataFrame()

In [20]:
# add the list to a new DataFrame.
schools_df["School ID"] = school_id

#print the DataFrame
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [21]:
schools_df["School Name"] = school_name
schools_df["School Type"] = type_of_school
schools_df

   School ID            School Name School Type
0          0      Huang High School    District
1          1   Figueroa High School    District
2          2    Shelton High School     Charter
3          3  Hernandez High School    District
4          4    Griffin High School     Charter

In [22]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name': school_name, 'type': type_of_school}

In [25]:
# Convert the dictionary high_schools_dict to a DataFrame.
school_df_dict = pd.DataFrame(high_schools_dict)
school_df_dict

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [28]:
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [29]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [30]:
school_df.values

array([[0, 'Huang High    School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [39]:
# Skill Drill at bottom of 4.3.5

# Create (initialize) a new DataFrame newschool_df:
newschool_df = pd.DataFrame()

# Create a list for each column:
school_id = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]
school_name = ["huang","figueroa", "shelton", "hernandez", "griffin", "wilson", "cabrera", "bailey", "holden", "pena", "wright", "rodriguez", "johnson", "ford", "thomas"]
school_type = ["district","district","charter","district","charter","charter","charter","district","charter","charter","charter","district","district","district","charter"]

# Add lists to a new DataFrame.
newschool_df["School ID"] = school_id
newschool_df["School Name"] = school_name
newschool_df["School Type"] = school_type

# Print the DataFrame.
newschool_df

    School ID School Name School Type
0           0       huang    district
1           1    figueroa    district
2           2     shelton     charter
3           3   hernandez    district
4           4     griffin     charter
5           5      wilson     charter
6           6     cabrera     charter
7           7      bailey    district
8           8      holden     charter
9           9        pena     charter
10         10      wright     charter
11         11   rodriguez    district
12         12     johnson    district
13         13        ford    district
14         14      thomas     charter